/* Лабораторная работа 2
   Вариант 20
   Заданы размеры трёх прямоугольников.
   Определить, могут ли два из них быть размещены внутри третьего. */
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main() {
	system ("chcp 1251 > nul");
	
	double a1, b1, a2, b2, a3, b3;
	
	printf("Введите стороны первого прямоугольника: \n");
	scanf ("%lf%lf", &a1, &b1);
	
	printf("Введите стороны второго прямоугольника: \n");
	scanf ("%lf%lf", &a2, &b2); 
	
	printf("Введите стороны третьего прямоугольника: \n");
		scanf ("%lf%lf", &a3, &b3);

	if (a1>0 && b1>0 && a2>0 && b2>0 && a3>0 && b3>0) {
		
	    if (a1*b1<a3*b3 && a2*b2<a3*b3) {
		   	if ((a1+a2<=a3 && b1<=b3 && b2<=b3)||(a1+b2<=a3 && b1<=b3 && a2<=b3) 
		  	  ||(b1+a2<=a3 && a1<=b3 && b2<=b3)||(b1+b2<=a3 && a1<=b3 && a2<=b3)
		   	  ||(a1+a2<=b3 && b1<=a3 && b2<=a3)||(a1+b2<=b3 && b1<=a3 && a2<=a3)
		   	  ||(b1+a2<=b3 && a1<=a3 && b2<=a3)||(b1+b2<=b3 && a1<=a3 && a2<=a3))
		   	 	printf ("Первый и второй прямоугольники помещаются в третий.\n");
		
			else printf ("Невозможно разместить два прямогуольника в третьем.\n");
		}
		else if (a1*b1<a2*b2 && a3*b3<a2*b2) {
			if ((a1+a3<=a2 && b1<=b2 && b3<=b2)||(a1+b3<=a2 && b1<=b2 && a3<=b2)
		 	  ||(b1+a3<=a2 && a1<=b2 && b3<=b2)||(b1+b3<=a2 && a1<=b2 && a3<=b2)
		  	  ||(a1+a3<=b2 && b1<=a2 && b3<=a2)||(a1+b3<=b2 && b1<=a2 && a3<=a2)
		  	  ||(b1+a3<=b2 && a1<=a2 && b3<=a2)||(b1+b3<=b2 && a1<=a2 && a3<=a2))
			  	printf ("Первый и третий прямоугольники помещаются во второй.\n");
		
			else printf ("Невозможно разместить два прямогуольника в третьем.\n");
		}
		else if (a2*b2<a1*b1 && a3*b3<a1*b1) {
		 	if ((a2+a3<=a1 && b2<=b1 && b3<=b1)||(a2+b3<=a1 && b2<=b1 && a3<=b1)
		  	  ||(b2+a3<=a1 && a2<=b1 && b3<=b1)||(b2+b3<=a1 && a2<=b1 && a3<=b1)
		  	  ||(a2+a3<=b1 && b2<=a1 && b3<=a1)||(a2+b3<=b1 && b2<=a1 && a3<=a1)
		  	  ||(b2+a3<=b1 && a2<=a1 && b3<=a1)||(b2+b3<=b1 && a2<=a1 && a3<=a1))
				printf("Второй и третий прямоугольники помещаются в первый.\n");

			else printf ("Невозможно разместить два прямогуольника в третьем.\n");
		}
		else printf ("Невозможно разместить два прямогуольника в третьем.\n");
	} else
		printf("\aОШИБКА: вы ввели некорректные данные. Попробуйте ещё раз.\n");
		 
	system ("pause");
	return 0;
}	
